[
  {
    "title": "Joao Vedana",
    "description": "A website I created for João Vedana, a musician. It is built with *NextJS* and a CMS called Sanity. The system is set up in a way that whenever the content changes Vercel creates new static files to be served, which provides for a fast load time and makes it SEO-friendly.",
    "url": "https://www.joaovedana.com/",
    "image": "/joao.png",
    "video": "joao.mp4"
  },
  {
    "title": "Arteliergalerie de Garage",
    "description": "A visual artists (responsive) website that Ive built with *NextJS*. It is mainly used for displaying images of upcoming exhibitions, so I made sure that all images are lazy loaded (using Javascripts *intersection* *observer* *API*). The website is in Dutch.",
    "url": "https://www.ateliergaleriedegarage.nl/",
    "image": "/degarage.png",
    "video": "degarage.mov"
  },
  {
    "title": "Regexpert",
    "description": "I love *regular* *expressions*. They are short and powerful, but often hard to read. Javascript provides some methods to handle regular expressions. I decided to make a small webapp that lets you test various regExp methods on strings, and outputs colored data.",
    "url": "https://regexp-tester.netlify.app/",
    "image": "/regexpert.png",
    "video": "regexpert.mp4"
  },

  {
    "title": "Movie Matcher",
    "description": "A full stack project: create an account, rate movies, connect with friends and find out which movie you both interested in. It uses *VueJS* and *Bootstrap* in the front-end, *Express* in the back. It's hosted on Heroku, using a free tier so be patient as it loads :)",
    "url": "https://incredible-movie-matcher.herokuapp.com/",
    "image": "/moviematcher.png",
    "video": "moviematcher.mov"
  },
  {
    "title": "Movie Matcher2",
    "description": "I took some time to make this portfolio, so I thought I might as well add it to my portfolio. It's created with the help of *React*, but I used as little libraries as possible. Linked below is the source code. It's my latest project so it reflects best the way I code now.",
    "url": "https://github.com/droomoord/kris-heijnen",
    "image": "/portfolio.png",
    "video": "portfolio.mov"
  },
  {
    "title": "Global Marketplaces REST API",
    "description": "I created an API that searches products on various digital global marketplaces. Under the hood it uses Node and Express, and it is deployed on a Digital Ocean droplet.",
    "url": "https://rapidapi.com/wildwildweb/api/global-marketplaces",
    "image": "/api.png"
  }
]
